Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: གྲོང་པ་དག་ཁྱེད་ཀྱིས་དེའི་ཕྱིར་རྩྭ་ཅན་གྱི་ཤར་ཕྱོགས་སུ་ཆོས་དང་མཐུན་པའི་ཁང་བཟངས་མཆུར་དཔག་ཚད་གཅིག་རྒྱར་དཔག་ཚད་གཅིག་པ་ཞིག་རྩིགས་ཤིག །དེ་ནས་ཁམས་ཀྱི་རྒྱལ་ཕྲན་བརྒྱད་ཁྲི་བཞི་སྟོང་གིས་རྩྭ་ཅན་གྱི་ཤར་ཕྱོགས་སུ་ཆོས་དང་མཐུན་པའི་ཁང་བཟངས་རྒྱར་དཔག་ཚད་གཅིག །མཆུར་དཔག་ཚད་གཅིག་པ་ཞིག་བརྩིགས་ཏེ།
en: “ ‘Gentlemen, in this case you should build a palace that is in accordance with the law one yojana in length and width to the east of Kuśāvatī.’ “Then the eighty-four thousand neighboring minor kings built the palace in accordance with the law one yojana in length and width to the east of Kuśāvatī.

source: ཆོས་དང་མཐུན་པའི་ཁང་བཟངས་ཀྱི་ཀ་རྟེན་གྱི་གཞི་རྣམ་པ་བཞི་པོ་གསེར་ལས་བྱས་པ་དང་། དངུལ་ལས་བྱས་པ་དང་། བཻ་ཌཱུརྱ་ལས་བྱས་པ་དང་། ཤེལ་ལས་བྱས་པ་བྲེས་སོ།
en: They established foundations made of gold, silver, lapis lazuli, and crystal for the palace, in accordance with the law.

source: །ཆོས་དང་མཐུན་པའི་ཁང་བཟངས་ལ་ཀ་བ་རྣམ་པ་བཞི་པོ་གསེར་ལས་བྱས་པ་དང་། ཞེས་བྱ་བ་ནས་ཤེལ་ལས་བྱས་པའི་བར་དག་བཙུགས་སོ།
en: They built pillars made of gold . . . and crystal for the palace, in accordance with the law.

source: །གསེར་ལས་བྱས་པའི་ཀ་བའི་ཀ་རྟེན་དང་། ཀ་ཞུ་དང་། བྲེ་ཕུལ་དང་། གདུང་ནི་དངུལ་ལས་བྱས་སོ།
en: The pedestals, bearing blocks, capitals, and beams of the gold pillars were made of silver;

source: །དངུལ་ལས་བྱས་པའི་ནི་གསེར་ལས་བྱས་སོ།
en: those of the silver pillars were made of gold;

source: །བཻ་ཌཱུརྱ་ལས་བྱས་པའི་ནི་ཤེལ་ལས་བྱས་སོ།
en: those of the lapis lazuli pillars were made of crystal;

source: །ཤེལ་ལས་བྱས་པའི་ཀ་བའི་ཀ་རྟེན་དང་། ཀ་ཞུ་དང་། བྲེ་ཕུལ་དང་། གདུང་ནི་བཻ་ཌཱུརྱ་ལས་བྱས་སོ།
en: and the pedestals, bearing blocks, capitals, and beams of the crystal pillars were made of lapis lazuli.

source: །ཆོས་དང་མཐུན་པའི་ཁང་བཟངས་ལ་ཕྱི་ཚེ་རྣམ་པ་བཞི་པོ་གསེར་ལས་བྱས་པ་ནས་ཤེལ་ལས་བྱས་པའི་བར་དག་བྲེས་སོ།
en: They set up four kinds of short beams, rafters, and long beams made of gold . . . and crystal for the palace, in accordance with the law.

source: །ཆོས་དང་མཐུན་པའི་ཁང་བཟངས་ལ་ཕྱམ་རྣམ་པ་བཞི་པོ་གསེར་ལས་བྱས་པ་ནས་ཤེལ་ལས་བྱས་པའི་བར་བཀྱེའོ།
en: They put up four kinds of domes made of gold . . . and crystal on the palace, in accordance with the law.

source: །ཆོས་དང་མཐུན་པའི་ཁང་བཟངས་ལ་གདུང་རིངས་རྣམ་པ་བཞི་པོ་གསེར་ལས་བྱས་པ་ནས་ཤེལ་ལས་བྱས་པའི་བར་བྲེས་སོ། །ཆོས་དང་མཐུན་པའི་ཁང་བཟངས་ལ་བ་གམ་རྣམ་པ་བཞི་པོ་གསེར་ལས་བྱས་པ་ནས་ཤེལ་ལས་བྱས་པའི་བར་བཏགས་སོ།
en: They covered the palace, in accordance with the law, with four kinds of slabs made of gold . . . and crystal.

source: །ཆོས་དང་མཐུན་པའི་ཁང་བཟངས་ལ་སྤང་ལེབ་རྣམ་པ་བཞི་པོ་གསེར་ལས་བྱས་པ་ནས་ཤེལ་ལས་བྱས་པའི་བར་གྱིས་གཡོགས་སོ། །ཆོས་དང་མཐུན་པའི་ཁང་བཟངས་ལ་ཐེམ་སྐས་རྣམ་པ་བཞི་པོ་གསེར་ལས་བྱས་པ་ནས། ཤེལ་ལས་བྱས་པའི་བར་བརྩིགས་སོ།
en: They built four kinds of staircases made of gold . . . and crystal in the palace, in accordance with the law.

source: །ཆོས་དང་མཐུན་པའི་ཁང་བཟངས་ལ་ལན་ཀན་རྣམ་པ་བཞི་པོ་གསེར་ལས་བྱས་པ་ནས་ཤེལ་ལས་བྱས་པའི་བར་གྱིས་བསྐོར་ཏོ།
en: They surrounded the palace, in accordance with the law, with four kinds of parapets made of gold . . . and crystal.

source: །གསེར་ལས་བྱས་པའི་ལན་ཀན་གྱི་གཟུངས་གཟེར་དང་། གདང་བུ་དང་། ལན་ཀན་གྱི་རྟེན་མ་ནི་དངུལ་ལས་བྱས་སོ།
en: The nails, rails, and bases of the gold parapets were made of silver;

source: །དངུལ་ལས་བྱས་པའི་ནི་གཟུངས་གཟེར་དང་། གདང་བུ་དང་། ལན་ཀན་གྱི་རྟེན་མ་གསེར་ལས་བྱས་སོ།
en: those of the silver parapets were made of gold; those of the lapis lazuli parapets were made of crystal;

source: །ཤེལ་ལས་བྱས་པའི་ནི་གཟུངས་གཟེར་དང་། གདང་བུ་དང་། ལན་ཀན་གྱི་རྟེན་མ་བཻ་ཌཱུརྱ་ལས་བྱས་སོ།
en: and those of the crystal parapets were made of lapis lazuli.

source: །ཡང་ཆོས་དང་མཐུན་པའི་ཁང་བཟངས་ལ་ཁང་པ་རྩེག་མ་བརྒྱད་ཁྲི་བཞི་སྟོང་བརྩིགས་ཏེ། ཁང་པ་རྩེག་མ་རྣམ་པ་བཞི་པོ་གསེར་ལས་བྱས་པ་ནས་ཤེལ་ལས་བྱས་པའི་བར་རྣམས་ལ།
en: Furthermore, they built eighty-four thousand balconies made of gold . . . and crystal on the palace, in accordance with the law.

source: གསེར་ལས་བྱས་པའི་ཁང་པ་རྩེག་མར་ནི་དངུལ་ལས་བྱས་པའི་ཁྲི་ལྷས་མ་ཅན་འགོ་ན་ཀའི་རས་ཀྱི་གདིང་བ་ཅན་དང་། སྟན་ནང་ཚངས་ཅན་གྱི་གདིང་བ་ཅན་དང་། ཟ་འུག་གི་གདིང་བ་ཅན་དང་། ཨར་མོ་ནིག་གི་གདིང་བ་ཅན་དང་། ཀ་ལིང་ཀའི་རས་ཕྲན་གྱི་གདིང་བ་ཅན་སྟེང་གཡོགས་དང་བཅས་པ་ཕྱོགས་གཉིས་སུ་སྔས་དམར་པོ་བཅུག་པའི་བར་དག་བཤམས་སོ།
en: On the balconies made of gold, they arranged braided couches made of silver, which were covered with woolen cloth, cushions, satin cloth, white blankets, and cloth from Kaliṅga, and were provided with an upper covering and red pillows at both ends.

source: །དངུལ་ལས་བྱས་པ་ལ་ནི་གསེར་ལས་བྱས་པའོ།
en: On the silver balconies, couches made of gold;

source: །བཻ་ཌཱུརྱ་ལས་བྱས་པ་ལ་ནི་ཤེལ་ལས་བྱས་པའོ།
en: on the lapis lazuli balconies, couches made of crystal;

source: །ཤེལ་ལས་བྱས་པ་ལ་ནི་བཻ་ཌཱུརྱ་ལས་བྱས་པའི་ཁྲི་ལྷས་མ་ཅན་ནས་ཕྱོགས་གཉིས་སུ་སྔས་དམར་པོ་བཙུགས་པའི་བར་དག་བཤམས་སོ།
en: on the crystal balconies, they arranged braided couches made of lapis lazuli, which were . . . red pillows at both ends.

source: །གསེར་ལས་བྱས་པའི་ཁང་པ་རྩེག་མའི་མདུན་དུ་ནི་དངུལ་ལས་བྱས་པའི་ཤིང་ཏ་ལ་ལོ་མ་དང་། མེ་ཏོག་དང་། འབྲས་བུ་གསེར་ལས་བྱས་པ་སྦྲེངས་སོ།
en: “In front of the gold balcony, they arranged palm trees made of silver, whose leaves, flowers, and fruits were made of gold;

source: །དངུལ་ལས་བྱས་པའི་མདུན་དུ་ནི་གསེར་ལས་བྱས་པའོ།
en: in front of the silver balcony, palm trees made of gold;

source: །བཻ་ཌཱུརྱ་ལས་བྱས་པའི་མདུན་དུ་ནི་ཤེལ་ལས་བྱས་པའོ།
en: in front of the lapis lazuli balcony, palm trees made of crystal;

source: །ཤེལ་ལས་བྱས་པའི་མདུན་དུ་ནི་བཻ་ཌཱུརྱ་ལས་བྱས་པ་ལོ་མ་དང་། མེ་ཏོག་དང་། འབྲས་བུ་ཤེལ་ལས་བྱས་པ་སྦྲེངས་སོ།
en: and in front of the crystal balcony, palm trees made of lapis lazuli, whose leaves, flowers, and fruits were made of crystal.

source: །ཤིང་ཏ་ལ་དེ་རྣམས་རླུང་གིས་བསྐྱོད་པ་ན་འདི་ལྟ་བུའི་སྒྲ་ཡིད་དུ་འོང་བ་འབྱུང་སྟེ། དཔེར་ན་སྐྱེས་བུ་མཁས་པས་སིལ་སྙན་ཡན་ལག་ལྔ་དང་ལྡན་པ་ཡང་དག་པར་ལེགས་པར་བསྒྲགས་པ་བཞིན་ནོ།
en: When these palm trees swayed in the breeze, they made a pleasant sound as if a skilled musician were skillfully playing a five-part musical instrument.

source: །ཆོས་དང་མཐུན་པའི་ཁང་བཟངས་ལ་གསེར་གྱི་བྱེ་མ་བདལ་ཅིང་ཙན་དན་གྱི་ཆུས་ཆག་ཆག་བཏབ་ལ། གསེར་གྱི་དྲ་བ་དང་གསེར་གྱི་དྲིལ་བུ་གཡེར་ཀ་བརྒྱུས་པས་བཏགས་སོ།
en: “In the palace that was in accordance with the law they spread golden sand, sprinkled sandalwood water, and set up golden nets to which golden bells were tied.

source: །དེ་ནས་ཁམས་ཀྱི་རྒྱལ་ཕྲན་བརྒྱད་ཁྲི་བཞི་སྟོང་གིས་ཆོས་དང་མཐུན་པའི་ཁང་བཟངས་ཀྱི་བྱ་བ་ཐམས་ཅད་ཟིན་པར་རིག་ནས། ཆོས་དང་མཐུན་པའི་ཁང་བཟངས་ཀྱི་མདུན་དུ་ཆོས་དང་མཐུན་པའི་རྫིང་མཆུར་དཔག་ཚད་གཅིག་རྒྱར་དཔག་ཚད་གཅིག་པ་ཞིག་བརྐོས་ཏེ་ཆོས་དང་མཐུན་པའི་རྫིང་བུ་ཕ་གུ་རྣམ་པ་བཞི་པོ་གསེར་ལས་བྱས་པ་དང་། དངུལ་ལས་བྱས་པ་དང་། བཻ་ཌཱུརྱ་ལས་བྱས་པ་དང་། ཤེལ་ལས་བྱས་པས་བརྩིགས་སོ།
en: “Thereupon, knowing that all the construction of the palace that was in accordance with the law had been completed, the eighty-four thousand neighboring minor kings dug a pond in accordance with the law, one yojana in length and width, in front of the palace in accordance with the law, and lined the pond in accordance with the law with slabs made of gold, silver, lapis lazuli, and crystal.

source: །ཆོས་དང་མཐུན་པའི་རྫིང་ལ་ཐེམ་སྐས་རྣམ་པ་བཞི་པོ་གསེར་ལས་བྱས་པ་ནས་ཤེལ་ལས་བྱས་པའི་བར་གྱིས་བརྩིགས་སོ།
en: “They built four kinds of staircases made of gold . . . and crystal in the pond that was in accordance with the law.

source: །ཆོས་དང་མཐུན་པའི་རྫིང་ལ་ལན་ཀན་རྣམ་པ་བཞི་པོ་གསེར་ལས་བྱས་པའི་ནས་ཤེལ་ལས་བྱས་པའི་བར་གྱིས་བསྐོར་ཏེ།
en: They surrounded the pond that was in accordance with the law with four kinds of parapets made of gold . . . and crystal.

source: གསེར་ལས་བྱས་པའི་ལན་ཀན་གྱི་གཟུངས་གཟེར་དང་། གདང་བུ་དང་། ལན་ཀན་གྱི་རྟེན་མ་དངུལ་ལས་བྱས་སོ།
en: The nails, rails, and bases of the gold parapets were made of silver;

source: །ཤེལ་ལས་བྱས་པའི་གཟུངས་གཟེར་དང་། གདང་བུ་དང་། ལན་ཀན་གྱི་རྟེན་མ་བཻཌཱུརྱ་ལས་བྱས་སོ།
en: and the nails, rails, and bases of the crystal parapets were made of lapis lazuli.

source: །ཆོས་དང་མཐུན་པའི་རྫིང་བུ་ཆུ་ནས་སྐྱེས་པའི་མེ་ཏོག་རྣམ་པ་སྣ་ཚོགས་འདི་ལྟ་སྟེ། ཨུཏྤ་ལ་དང་། པད་མ་དང་། ཀུ་མུ་ད་དང་། པད་མ་དཀར་པོ་དང་། དྲི་ཞིམ་པ་དང་། དྲི་ངད་འཇམ་པ་དང་། དུས་ཚིགས་ཐམས་ཅད་པ་དང་། དུས་ཐམས་ཅད་པའི་མེ་ཏོག་སྐྱེ་བོ་ཐམས་ཅད་ལ་དགག་པ་མེད་པ་བསྐྱེད་དོ།
en: “In the pond that was in accordance with the law, they grew various aquatic flowers, namely, utpala, padma, kumuda, puṇḍarīka, saugandhika, mṛdugandhika, and flowers of all seasons—flowers of all times of year that were harmless to everyone.

source: །ཆོས་དང་མཐུན་པའི་རྫིང་གི་འགྲམ་གཉིས་སུ་ཐང་ལ་སྐྱེ་བའི་མེ་ཏོག་རྣམ་པ་སྣ་ཚོགས་འདི་ལྟ་སྟེ། ཨ་ཏི་མུག་ཏ་ཀ་དང་། ཙམ་པ་ཀ་དང་། པ་ཏ་ལ་དང་། པ་རི་ཀ་ཤ་དང་། མ་ལི་ཀ་དང་། ན་བམ་ལི་ཀ་དང་། ཡིད་དུ་འོང་དང་། ཡུ་ཏི་ཀ་དང་། དྷཱ་ནུ་སྐ་རི་དང་། དུས་ཚིགས་ཐམས་ཅད་པ་དང་། དུས་ཐམས་ཅད་པའི་མེ་ཏོག་སྐྱེ་བོ་ཐམས་ཅད་ལ་དགག་པ་མེད་པ་དག་བསྐྱེད་དོ།
en: “On two banks of the pond that was in accordance with the law, they grew various terrestrial flowers, namely, atimuktaka, campaka, pāṭala, vārṣikā, mallikā, navamallikā, sumanā, yūthikā, dhānuṣkārī, and flowers of all seasons—flowers of all times of year that were harmless to everyone.

source: །ཆོས་དང་མཐུན་པའི་རྫིང་དུ་གསེར་གྱི་གཅལ་བཀྲམ་ཞིང་ཙན་དན་གྱི་ཆུས་བཀང་ལ་གསེར་གྱི་དྲ་བ་དང་། གསེར་གྱི་དྲིལ་བུ་གཡེར་ཀ་བརྒྱུས་པས་བྲེས་སོ།
en: “Around the pond that was in accordance with the law, they spread golden sand, sprinkled sandalwood water, and set up golden nets to which golden bells were tied.

source: །དེ་ནས་ཁམས་ཀྱི་རྒྱལ་ཕྲན་བརྒྱད་ཁྲི་བཞི་སྟོང་གིས་ཆོས་དང་མཐུན་པའི་རྫིང་གི་བྱ་བ་ཐམས་ཅད་ཟིན་པར་རིག་ནས། ཆོས་དང་མཐུན་པའི་རྫིང་གི་མདུན་དུ་ཆོས་དང་མཐུན་པའི་ཤིང་ཏ་ལའི་ཚལ་མཆུར་དཔག་ཚད་གཅིག་རྒྱར་དཔག་ཚད་གཅིག་པ་ཞིག་བཙུགས་ཏེ།
en: “Thereupon, knowing that all the construction of the pond that was in accordance with the law had been completed, the eighty-four thousand neighboring minor kings made a palm tree forest that was in accordance with the law, one yojana in length and width, in front of the pond that was in accordance with the law.

source: ཆོས་དང་མཐུན་པའི་ཤིང་ཏ་ལའི་ཚལ་དུ་ཏ་ལ་རྣམ་པ་བཞི་པོ་གསེར་ལས་བྱས་པ་ནས་ཤེལ་ལས་བྱས་པའི་བར་བཙུགས་པ་ལ།
en: In the palm tree forest that was in accordance with the law, they made four kinds of palm trees made of gold . . . crystal.

source: གསེར་ལས་བྱས་པའི་ལོ་མ་དང་། མེ་ཏོག་དང་། འབྲས་བུ་དངུལ་ལས་བྱས་པ་བཙུགས་སོ།
en: The leaves, flowers, and fruits of the gold palm trees were made of silver;

source: །གསེར་ལས་བྱས་པའི་ནི་བཻ་ཌཱུརྱ་ལས་བྱས་སོ།
en: those of the lapis lazuli palm trees were made of crystal;

source: །བཻ་ཌཱུརྱ་ལས་བྱས་པའི་ལོ་མ་དང་། མེ་ཏོག་དང་། འབྲས་བུ་ཤེལ་ལས་བྱས་པ་བཙུགས་སོ། །ཡང་ཤིང་ཏ་ལའི་ཚལ་དེ་རྣམས་རླུང་གིས་བསྐྱོད་པ་ན་འདི་ལྟ་བུའི་སྒྲ་ཡིད་དུ་འོང་བ་འབྱུང་བར་འགྱུར་ཏེ། དཔེར་ན་སྐྱེས་བུ་མཁས་པས་སིལ་སྙན་ཡན་ལག་ལྔ་དང་ལྡན་པ་ཡང་དག་པར་ལེགས་པར་བསྒྲགས་པ་བཞིན་ནོ།
en: and those of the crystal palm trees were made of lapis lazuli. When these palm trees swayed in the breeze, they made a pleasant sound as if a skilled musician were skillfully playing a five-part musical instrument.

source: །ཆོས་དང་མཐུན་པའི་ཤིང་ཏ་ལའི་ཚལ་ལ་ལན་ཀན་རྣམ་པ་བཞི་པོ་གསེར་ལས་བྱས་པ་དང་། དངུལ་ལས་བྱས་པ་དང་། རིན་པོ་ཆེ་ལས་བྱས་པ་དང་། ཤེལ་ལས་བྱས་པས་བསྐོར་ཏེ།
en: “They surrounded the palm tree forest that was in accordance with the law with four kinds of parapets made of gold, silver, jewels, and crystal.

source: གསེར་ལས་བྱས་པའི་ལན་ཀན་གྱི་གཟུངས་གཟེར་དང་། གདང་བུ་དང་། ལན་ཀན་གྱི་རྟེན་མ་ནི་དངུལ་ལས་བྱས་པས་བསྐོར་ཏོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་ནོ།
en: The nails, rails, and bases of the gold parapets were made of silver . . . .

source: །ཆོས་དང་མཐུན་པའི་ཤིང་ཏ་ལའི་ཚལ་ན་གསེར་གྱི་གཅལ་བཀྲམ་ཞིང་ཙན་དན་གྱི་ཆུས་ཆག་ཆག་བཏབ་ལ། གསེར་གྱི་དྲ་བ་གསེར་གྱི་དྲིལ་བུ་གཡེར་ཀ་བརྒྱུས་པ་བྲེས་སོ།
en: In the palm tree forest that was in accordance with the law they spread golden sand, sprinkled sandalwood water, and set up golden nets to which golden bells were tied.

source: །དེ་ནས་ཁམས་ཀྱི་རྒྱལ་ཕྲན་བརྒྱད་ཁྲི་བཞི་སྟོང་གིས་ཆོས་དང་མཐུན་པའི་ཁང་བཟངས་དང་། ཆོས་དང་མཐུན་པའི་རྫིང་དང་། ཆོས་དང་མཐུན་པའི་ཤིང་ཏ་ལའི་ཚལ་གྱི་བྱ་བ་ཐམས་ཅད་ཟིན་པར་རིག་ནས་རྒྱལ་པོ་ལེགས་མཐོང་ཆེན་པོ་གང་ན་བ་དེར་དོང་སྟེ་ལྷགས་པ་དང་། རྒྱལ་པོ་ལེགས་མཐོང་ཆེན་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: “Thereupon, knowing that all the construction of the palace that was in accordance with the law, the pond that was in accordance with the law, and the palm tree forest that was in accordance with the law had been completed, the eighty-four thousand neighboring minor kings went to King Mahāsudarśana.

source: །ལྷའི་ཆོས་དང་མཐུན་པའི་ཁང་བཟངས་དང་། ཆོས་དང་མཐུན་པའི་རྫིང་དང་ཆོས་དང་མཐུན་པའི་ཤིང་ཏ་ལའི་ཚལ་ཡང་བགྱིས་ལགས་ཏེ།
en: When they arrived, they said to King Mahāsudarśana, ‘We have built Your Majesty’s palace in accordance with the law, a pond in accordance with the law, and a palm tree forest.

source: ལྷ་ད་ནི་དེའི་དུས་ལ་བབ་པར་དགོངས་ཤིག །དེ་ནས་རྒྱལ་པོ་ལེགས་མཐོང་ཆེན་པོ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: May Your Majesty know that their time has now come.’

source: འདི་ལྟར་ཁང་བཟངས་འདི་ཉིད་དུ་ཐོག་མར་བདག་ཁོ་ན་གནས་པ་ནི་བདག་གི་ཆ་མ་ཡིན་གྱིས།
en: “Then King Mahāsudarśana thought, ‘It would not be right for me to live by myself in this palace first.

source: མ་ལ་བདག་གིས་བདག་གི་ཡུལ་ན་དགེ་སྦྱོང་དང་། བྲམ་ཟེ་དང་། ཚུལ་བཟང་པོར་བཀུར་བ་གང་དག་གནས་པ་དེ་དག་ཆོས་དང་མཐུན་པའི་ཁང་བཟངས་སུ་ཟན་བྱིན་ལ། རེ་རེ་ལ་རས་བཅོས་བུ་སར་པ་ཟུང་རེ་བསྐོན་ནོ་སྙམ་ནས།
en: In the palace that is in accordance with the law, I will now give food to śramaṇas, brahmins, and people of good conduct living in my land and provide each of them with a pair of new cotton robes.’

source: དེ་ནས་རྒྱལ་པོ་ལེགས་མཐོང་ཆེན་པོས་ཆོས་དང་མཐུན་པའི་ཁང་བཟངས་སུ་རང་སངས་རྒྱས་ལྔ་བརྒྱ་ལ་ཟན་བྱིན་ཏེ། རེ་རེ་ལ་ཡང་རས་བཅོས་བུ་ཟུང་རེ་བསྐོན་ནས་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: “Thereupon King Mahāsudarśana gave food to five hundred self-awakened ones, provided each of them with a pair of new cotton robes, and spoke some verses:

source: མཁས་པས་ནོར་ནི་མང་པོ་དག །རྙེད་ནས་བག་མེད་མི་བྱ་སྟེ།
en: “ ‘Having attained vast wealth, The wise do not become careless.

source: །ཚུལ་ཁྲིམས་ལྡན་པ་གང་དག་ལ།
en: They give donations to people of good conduct

source: །ཡོན་གྲུབ་འགྱུར་བ་རྣམས་ལ་སྦྱིན།
en: Where they will bear fruit.

source: །དེ་ལྟར་ཡིད་གཞུངས་དད་པ་ཅན།
en: “ ‘Thus an intelligent man gives

source: །མ་ཆགས་སེམས་ཀྱིས་འདིར་སྦྱིན་ནས།
en: With a liberated mind in this world;

source: །མཁས་པ་འཇིག་རྟེན་གནོད་མེད་པ། །བདེ་བ་ཅན་དུ་སྐྱེ་བར་འགྱུར།
en: The wise will be reborn In a harmless, happy world.’

source: །རྒྱལ་པོ་ཆེན་པོ་དེའི་ཚེ་དེའི་དུས་ཀྱི་རྒྱལ་པོ་ལེགས་མཐོང་ཆེན་པོ་ཞེས་བྱ་བ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་གླིང་བཞི་ལ་དབང་བ་རིན་པོ་ཆེ་སྣ་བདུན་དང་། མི་རྣམས་ཀྱི་འབྱོར་པ་རྣམ་པ་བཞི་དང་ལྡན་པར་གྱུར་པ་དེ་གཞན་ཡིན་སྙམ་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: “Great King, if you think that the one who was that wheel-turning king named Mahāsudarśana, who had ruled the four continents and had attained the seven treasures and four kinds of human success at that time, on that occasion, was someone else, you should think otherwise.

source: ང་ཉིད་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་ལེགས་མཐོང་ཆེན་པོ་ཞེས་བྱ་བ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་གླིང་བཞི་ལ་དབང་བ། རིན་པོ་ཆེ་སྣ་བདུན་དང་ལྡན་པ། མི་རྣམས་ཀྱི་འབྱོར་པ་རྣམ་པ་བཞི་དང་ལྡན་པར་གྱུར་ཏོ།
en: I was the wheel-turning king named Mahāsudarśana, who had ruled the four continents and had attained the seven treasures and four kinds of human success at that time, on that occasion.

source: །རྒྱལ་པོ་ཆེན་པོ་ངས་སྦྱིན་པའམ། སྦྱིན་པའི་བགོ་བཤའ་དེས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཐོབ་བོ་སྙམ་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: “Great King, if you think that I attained supreme and complete awakening by these donations or distribution of donations, you should think otherwise;

source: འོན་ཀྱང་ངའི་སྦྱིན་པ་དེ་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་རྒྱུ་ཙམ་དང་། རྐྱེན་ཙམ་དང་། ཚོགས་ཙམ་ཡིན་ནོ།
en: these donations of mine were only a cause, only a condition, only a preparation for supreme and complete awakening.” 3. Velāma

source: །རྒྱལ་པོ་ཆེན་པོ་གཞན་ཡང་ངས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་དོན་དུ་གཉེར་བའི་ཕྱིར་སྦྱིན་པ་དག་བཏང་། བསོད་ནམས་དག་བྱས་པ་གང་ཡིན་པ་དེ་ཉོན་ཅིག །རྒྱལ་པོ་ཆེན་པོ་སྔོན་བྱུང་བ་བྲམ་ཟེ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུ་དུས་དཔོག་ཅེས་བྱ་བ་ཞིག་བྱུང་བར་གྱུར་ཏེ།
en: “Great King, again, seeking supreme and complete awakening, I gave donations and made merit. Listen to that story. “Great King, once there was a very wealthy brahmin named Velāma.

source: དེས་བྲམ་ཟེ་རྣམས་ལ་སྦྱིན་པ་འདི་ལྟ་བུ་བྱིན་ཏེ།
en: He gave donations to brahmins as follows:

source: གླང་པོ་ཆེ་གསེར་གྱིས་བརྒྱན་པ། གསེར་གྱིས་མཛེས་པར་བྱས་པ། གསེར་གྱི་རྒྱལ་མཚན་ཅན། གསེར་གྱི་དྲ་བས་གཡོགས་པ་བརྒྱད་ཁྲི་བཞི་སྟོང་བྲམ་ཟེ་རྣམས་ལ་སྦྱིན་པར་བྱིན་ནོ།
en: “He gave brahmins eighty-four thousand elephants adorned with gold, illuminated with gold, decorated with golden banners, and covered with golden nets.

source: །རྟ་གསེར་གྱིས་བརྒྱན་པ། གསེར་གྱིས་མཛེས་པར་བྱས་པ། གསེར་གྱི་དྲ་བས་གཡོགས་པ། བརྒྱད་ཁྲི་བཞི་སྟོང་བྲམ་ཟེ་རྣམས་ལ་སྦྱིན་པར་བྱིན་ནོ།
en: “He gave brahmins eighty-four thousand horses adorned with gold, illuminated with gold, and covered with golden nets.

source: །ཤིང་རྟ་རྣམ་པ་བཞི་པོ་གསེར་ལས་བྱས་པ་དང་། དངུལ་ལས་བྱས་པ་དང་། བཻ་ཌཱུརྱ་ལས་བྱས་པ་དང་། ཤེལ་ལས་བྱས་པ་སེང་གེའི་པགས་པས་གཡོགས་པ། གུང་ལྤགས་ཀྱིས་གཡོགས་པ། ཨར་མོ་ནིག་གིས་གཡོགས་པ། རྣམ་པར་རྒྱལ་བྱེད་ཀྱི་བ་དན་ཅན་བརྒྱད་ཁྲི་བཞི་སྟོང་བྲམ་ཟེ་རྣམས་ལ་སྦྱིན་པར་བྱིན་ནོ།
en: “He gave brahmins eighty-four thousand chariots made of either of four kinds of materials, namely, gold, silver, lapis lazuli, or crystal, covered with lion skins, leopard skins, and white blankets, and decorated with flags of victory.

source: །གསེར་གྱི་སྣོད་དངུལ་སིལ་མས་བཀང་བ་བརྒྱད་ཁྲི་བཞི་སྟོང་བྲམ་ཟེ་རྣམས་ལ་སྦྱིན་པར་བྱིན་ནོ།
en: “He gave brahmins eighty-four thousand golden vessels filled with powdered silver. “He gave brahmins eighty-four thousand silver vessels filled with gold dust.

source: །དངུལ་གྱི་སྣོད་གསེར་ཕྱེས་བཀང་བ་བརྒྱད་ཁྲི་བཞི་སྟོང་བྲམ་ཟེ་རྣམས་ལ་སྦྱིན་པར་བྱིན་ནོ། །ཁྲི་རྣམ་པ་བཞི་པོ་གསེར་ལས་བྱས་པ་དང་། དངུལ་ལས་བྱས་པ་དང་། བཻ་ཌཱུརྱ་ལས་བྱས་པ་དང་། ཤེལ་ལས་བྱས་པ་ལྷས་མ་ཅན་འགོ་ན་ཀའི་རས་བཏིང་བ། སྟན་ནང་ཚངས་ཅན་བཏིང་བ། སྟན་ཆེན་པོ་བཏིང་བ། ཀ་ལིང་ཀའི་གོས་ཀྱིས་སྟེང་གཡོགས་པ།
en: “He gave brahmins eighty-four thousand braided couches made of either of four kinds of materials—namely, gold, silver, lapis lazuli, or crystal—covered with woolen cloth, cushions, large coverings, and cloth from Kaliṅga, and provided with an upper covering and red pillows at both ends;

source: སྟེང་གཡོགས་རྩེག་མ་ཅན། ཕྱོགས་གཉིས་སུ་སྔས་དམར་པོ་བཤམས་པ་བརྒྱད་ཁྲི་བཞི་སྟོང་དང་། རས་ཟུང་རྣམ་པ་བཞི་པོ་ཀ་ཤི་ཀའི་རས་ཕྲན་དང་། ཟར་མའི་རས་ཕྲན་དང་། དུ་གུ་ལའི་རས་ཕྲན་དང་། ཀོ་ཏམ་པའི་རས་ཕྲན་ཟུང་བརྒྱད་ཁྲི་བཞི་སྟོང་དང་། བ་གསེར་གྱི་རྭ་ཅན་རྨིག་པ་དངུལ་ལས་བྱས་པ།
en: eighty-four thousand pairs of bolts of four kinds of cloth, namely, cloth from Kāśi, linen cloth, dukūla cloth, and koṭambaka cloth; eighty-four thousand cows that had golden horns, silver hooves, calves with beautiful coats of fur, and bronze buckets and were covered with pairs of pieces of cotton cloth;

source: བེའུ་སྤུ་མཐུན་དང་བཅས་པ། ཁར་བའི་ཟོ་བ་ཅན། རས་བཅོས་བུ་ཕྲུགས་ཀྱིས་གཡོགས་པ་བརྒྱད་ཁྲི་བཞི་སྟོང་དང་། བུ་མོ་གསེར་གྱི་དཔུང་རྒྱན་དང་མགུལ་རྒྱན་ཐོགས་པ།
en: and eighty-four thousand girls well adorned with golden armlets and necklaces.

source: ལེགས་པར་བརྒྱན་པ་བརྒྱད་ཁྲི་བཞི་སྟོང་བྲམ་ཟེ་རྣམས་ལ་སྦྱིན་པར་བྱིན་ན་ཟས་དང་། སྐོམ་དང་། བཟའ་བ་དང་། བཅའ་བ་དང་། བལྡག་པ་དང་། གཞིབ་པ་ལྟ་སྨོས་ཀྱང་ཅི་དགོས།
en: He gave all of these as donations, not to mention food and drink—foods to eat, drink, lick, and suck.

source: རྒྱལ་པོ་ཆེན་པོ་བྲམ་ཟེ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུ་དུས་དཔོག་གིས་བྲམ་ཟེ་རྣམས་ལ་དེ་ལྟ་བུའི་སྦྱིན་པ་བྱིན་པ་འདི་བས་ནི་གང་གིས་ཕྱི་རོལ་པའི་དྲང་སྲོང་འདོད་པ་རྣམས་ལས་འདོད་ཆགས་དང་བྲལ་བ་བརྒྱ་ཟན་བྱིན་ན་སྦྱིན་པ་དེ་ལས་སྦྱིན་པ་འདིའི་འབྲས་བུ་ཆེས་ཆེའོ།
en: “Great King, greater than such donations made to brahmins by the very wealthy brahmin Velāma is the result of the donation of one who gives food to one hundred ṛṣis who are non-Buddhist ascetics and free from desires.

source: །རྒྱལ་པོ་ཆེན་པོ་བྲམ་ཟེ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུ་དུས་དཔོག་གིས་བྲམ་ཟེ་རྣམས་ལ་སྦྱིན་པ་དེ་ལྟ་བུ་བྱིན་པ་གང་ཡིན་པ་འདི་དང་། གང་གིས་ཕྱི་རོལ་པའི་དྲང་སྲོང་འདོད་པ་རྣམས་ལས་འདོད་ཆགས་དང་བྲལ་བ་བརྒྱ་ཟན་བྱིན་པ་བས། གང་གིས་སོ་སོའི་སྐྱེ་བོ་འཛམ་བུའི་ཚལ་ན་འདུག་པ་གཅིག་ལ་ཟན་བྱིན་ན། སྦྱིན་པ་དེ་བས་སྦྱིན་པ་འདིའི་འབྲས་བུ་ཆེས་ཆེའོ།
en: “Great King, greater than such donations made to brahmins by the very wealthy brahmin Velāma and one who gives food to one hundred ṛṣis who are non-Buddhist ascetics and free from desires is the result of the donation of one who gives food to a single ordinary person dwelling in a forest of jambū trees.

source: །བྲམ་ཟེ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུ་དུས་དཔོག་གིས་བྲམ་ཟེ་རྣམས་ལ་སྦྱིན་པ་དེ་ལྟ་བུ་བྱིན་པ་གང་ཡིན་པ་འདི་དང་། གང་གིས་ཕྱི་རོལ་པའི་དྲང་སྲོང་འདོད་པ་རྣམས་ལས་འདོད་ཆགས་དང་བྲལ་བ་བརྒྱ་ཟན་བྱིན་པ་བས། གང་གིས་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱ་བའི་ཕྱིར་ཞུགས་པ་གཅིག་ལ་ཟན་བྱིན་ན། སྦྱིན་པ་དེ་བས་སྦྱིན་པ་འདིའི་འབྲས་བུ་ཆེས་ཆེའོ།
en: “Greater than such donations made to brahmins by the very wealthy brahmin Velāma and one who gives food to one hundred ṛṣis who are non-Buddhist ascetics and free from desires is the result of the donation of one who gives food to one person who is going to actualize the fruit of stream-entry.”

source: །དེ་ལ་སོགས་པ་རྒྱས་པར་ཐམས་ཅད་ལས་བརྩམས་ནས་ཐམས་ཅད་བརྗོད་པར་བྱས་ཏེ།
en: (This and so on are supposed to be stated in detail;

source: མཇུག་ཁོ་ན་བྲི་བར་བྱའོ།
en: only the conclusion of each case should be written as follows.)

source: །གང་གིས་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱ་བའི་ཕྱིར་ཞུགས་པ་བརྒྱ་ཟན་བྱིན་པ་བས། གང་གིས་རྒྱུན་དུ་ཞུགས་པ་གཅིག་ལ་ཟན་བྱིན་ན་སྦྱིན་པ་དེ་བས་སྦྱིན་པ་འདིའི་འབྲས་བུ་ཆེས་ཆེའོ།
en: “Greater than the donation of one who gives food to one hundred people who are going to actualize the fruit of stream-entry is the result of the donation of one who gives food to one stream-enterer.

source: །གང་གིས་རྒྱུན་དུ་ཞུགས་པ་བརྒྱ་ཟན་བྱིན་པ་བས། གང་གིས་ལན་གཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱ་བའི་ཕྱིར་ཞུགས་པ་གཅིག་ལ་བྱིན་ན་སྦྱིན་པ་དེ་བས་སྦྱིན་པ་འདིའི་འབྲས་བུ་ཆེས་ཆེའོ།
en: “Greater than the donation of one who gives food to one hundred stream-enterers is the result of the donation of one who gives food to one person who is going to actualize the fruit of a once-returner.

source: །གང་གིས་ལན་གཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱ་བའི་ཕྱིར་ཞུགས་པ་བརྒྱ་ཟན་བྱིན་པ་བས། གང་གིས་ལན་གཅིག་ཕྱིར་འོང་བ་གཅིག་ལ་བྱིན་ན་སྦྱིན་པ་དེ་བས་སྦྱིན་པ་འདིའི་འབྲས་བུ་ཆེས་ཆེའོ།
en: “Greater than the donation of one who gives food to one hundred people who are going to actualize the fruit of a once-returner is the result of the donation of one who gives food to one once-returner.

source: །གང་གིས་ལན་གཅིག་ཕྱིར་འོང་བ་བརྒྱ་ཟན་བྱིན་པ་བས་གང་གིས་ཕྱིར་མི་འོང་བའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱ་བའི་ཕྱིར་ཞུགས་པ་གཅིག་ལ་བྱིན་ན། སྦྱིན་པ་དེ་བས་སྦྱིན་པ་འདིའི་འབྲས་བུ་ཆེས་ཆེའོ།
en: “Greater than the donation of one who gives food to one hundred once-returners is the result of the donation of one who gives food to one person who is going to realize the fruit of a never-returner.

source: །གང་གིས་ཕྱིར་མི་འོང་བའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱ་བའི་ཕྱིར་ཞུགས་པ་བརྒྱ་ཟན་བྱིན་པ་བས། གང་གིས་ཕྱིར་མི་འོང་བ་གཅིག་ལ་སྦྱིན་ན་དེ་བས་སྦྱིན་པ་འདིའི་འབྲས་བུ་ཆེས་ཆེའོ།
en: “Greater than the donation of one who gives food to one hundred people who are going to actualize the fruit of a never-returner is the result of the donation of one who gives food to one never-returner.

source: །གང་གིས་ཕྱིར་མི་འོང་བ་བརྒྱ་བས་གང་གིས་དགྲ་བཅོམ་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱ་བའི་ཕྱིར་ཞུགས་པ་གཅིག་ལ་བྱིན་ན། སྦྱིན་པ་དེ་བས་སྦྱིན་པ་འདིའི་འབྲས་བུ་ཆེས་ཆེའོ།
en: “Greater than the donation of one who gives food to one hundred never-returners is the result of the donation of one who gives food to one person who is going to actualize the fruit of an arhat.

source: །གང་གིས་དགྲ་བཅོམ་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱ་བའི་ཕྱིར་ཞུགས་པ་བརྒྱ་བས་ནི་གང་གིས་དགྲ་བཅོམ་པ་གཅིག་ལ་བྱིན་ན། སྦྱིན་པ་དེ་བས་སྦྱིན་པ་འདིའི་འབྲས་བུ་ཆེས་ཆེའོ།
en: “Greater than the donation of one who gives food to one hundred people who are going to actualize the fruit of an arhat is the result of the donation of one who gives food to one arhat.

source: །གང་གིས་དགྲ་བཅོམ་པ་བརྒྱ་ཟན་བྱིན་པ་བས་གང་གིས་ཕྱོགས་བཞིའི་དགེ་སློང་གི་དགེ་འདུན་ལ་ཀུན་དགའི་ར་བ་འབུལ་ན། སྦྱིན་པ་དེ་བས་སྦྱིན་པ་འདིའི་འབྲས་བུ་ཆེས་ཆེའོ།
en: “Greater than the donation of one who gives food to one hundred arhats is the result of one who offers a park to the community of monks in the four directions.
